/*⁺₊⋆ ☾ ⋆ 𝟏𝟏𝟑𝟒𝟗 𝐒𝐲𝐦𝐦𝐞𝐭𝐫𝐢𝐜 𝐌𝐚𝐭𝐫𝐢𝐱 ⋆⁺₊⋆ ☁︎ */
/*

°. ⑅ ♱♡°.+┈ 𝐏𝐫𝐨𝐛𝐥𝐞𝐦 ┈+.°♡♱ ⑅.°
𝐋𝐞𝐭 𝐛𝟎, 𝐛𝟏, 𝐛𝟐, . . . ,
𝐛𝐧 𝐛𝐞 𝐢𝐧𝐭𝐞𝐠𝐞𝐫𝐬 𝐰𝐢𝐭𝐡 𝐛𝐤 > 𝟎 𝐟𝐨𝐫 𝐤 > 𝟎.
𝐓𝐡𝐞 𝐜𝐨𝐧𝐭𝐢𝐧𝐮𝐞𝐝 𝐟𝐫𝐚𝐜𝐭𝐢𝐨𝐧 𝐨𝐟 𝐨𝐫𝐝𝐞𝐫 𝐧 𝐰𝐢𝐭𝐡 𝐜𝐨𝐞𝐟𝐢𝐜𝐢𝐞𝐧𝐭𝐬𝐛𝟏, 𝐛𝟐, . . . , 𝐛𝐧 
𝐚𝐧𝐝 𝐭𝐡𝐞 𝐢𝐧𝐢𝐭𝐢𝐚𝐥 𝐭𝐞𝐫𝐦 𝐛𝟎 𝐢𝐬 𝐝𝐞𝐟𝐢𝐧𝐞𝐝 𝐛𝐲 𝐭𝐡𝐞 𝐟𝐨𝐥𝐥𝐨𝐰𝐢𝐧𝐠 𝐞𝐱𝐩𝐫𝐞𝐬𝐬𝐢𝐨𝐧

                　　𝟏
𝐛𝟎　+　———————————————————————
　                  　𝟏
        𝐛𝟏　+　———————————————　　
                            𝟏          
                𝐛𝟐　+...+　———
                        　　𝐛𝐧

𝐰𝐡𝐢𝐜𝐡 𝐜𝐚𝐧 𝐛𝐞 𝐚𝐛𝐛𝐫𝐞𝐯𝐢𝐚𝐭𝐞𝐝 𝐚𝐬 [𝐛𝟎; 𝐛𝟏, . . . , 𝐛𝐧].
𝐀𝐧 𝐞𝐱𝐚𝐦𝐩𝐥𝐞 𝐨𝐟 𝐚 𝐜𝐨𝐧𝐭𝐢𝐧𝐮𝐞𝐝 𝐟𝐫𝐚𝐜𝐭𝐢𝐨𝐧 𝐨𝐟 𝐨𝐫𝐝𝐞𝐫 
𝐧 = 𝟑 𝐢𝐬 [𝟐; 𝟑, 𝟏, 𝟒]. 
𝐓𝐡𝐢𝐬 𝐢𝐬 𝐞𝐪𝐮𝐢𝐯𝐚𝐥𝐞𝐧𝐭 𝐭𝐨

                　　𝟏
𝟐　+　———————————————————————————
　                  　𝟏                 𝟒𝟑 
        𝟑　+　———————————————————　= 　————
                    　    𝟏             𝟏𝟗
                𝟏　+　———————————
                    　    𝟒 

𝐖𝐫𝐢𝐭𝐞 𝐚 𝐩𝐫𝐨𝐠𝐫𝐚𝐦 𝐭𝐡𝐚𝐭 𝐝𝐞𝐭𝐞𝐫𝐦𝐢𝐧𝐞𝐬 𝐭𝐡𝐞 𝐞𝐱𝐩𝐚𝐧𝐬𝐢𝐨𝐧 𝐨𝐟 
𝐚 𝐠𝐢𝐯𝐞𝐧 𝐫𝐚𝐭𝐢𝐨𝐧𝐚𝐥 𝐧𝐮𝐦𝐛𝐞𝐫 𝐚𝐬 𝐚 𝐜𝐨𝐧𝐭𝐢𝐧𝐮𝐞𝐝 𝐟𝐫𝐚𝐜𝐭𝐢𝐨𝐧.
𝐓𝐨 𝐞𝐧𝐬𝐮𝐫𝐞 𝐮𝐧𝐢𝐪𝐮𝐞𝐧𝐞𝐬𝐬, 𝐦𝐚𝐤𝐞 𝐛𝐧 > 𝟏.

°. ⑅ ♱♡°.+┈ 𝐈/𝐎 ┈+.°♡♱ ⑅.°

⟡·⟡·⟡·𝐈𝐧𝐩𝐮𝐭·⟡·⟡·⟡
𝐓𝐡𝐞 𝐢𝐧𝐩𝐮𝐭 𝐜𝐨𝐧𝐬𝐢𝐬𝐭𝐬 𝐨𝐟 𝐚𝐧 𝐮𝐧𝐝𝐞𝐭𝐞𝐫𝐦𝐢𝐧𝐞𝐝 𝐧𝐮𝐦𝐛𝐞𝐫 𝐨𝐟 𝐫𝐚𝐭𝐢𝐨𝐧𝐚𝐥 𝐧𝐮𝐦𝐛𝐞𝐫𝐬. 
𝐄𝐚𝐜𝐡 𝐫𝐚𝐭𝐢𝐨𝐧𝐚𝐥 𝐧𝐮𝐦𝐛𝐞𝐫 𝐢𝐬 𝐝𝐞𝐟𝐢𝐧𝐞𝐝𝐛𝐲 𝐭𝐰𝐨 𝐢𝐧𝐭𝐞𝐠𝐞𝐫𝐬, 
𝐧𝐮𝐦𝐞𝐫𝐚𝐭𝐨𝐫 𝐚𝐧𝐝 𝐝𝐞𝐧𝐨𝐦𝐢𝐧𝐚𝐭𝐨𝐫.

⟡·⟡·⟡·𝐎𝐮𝐭𝐩𝐮𝐭·⟡·⟡·⟡
𝐅𝐨𝐫 𝐞𝐚𝐜𝐡 𝐫𝐚𝐭𝐢𝐨𝐧𝐚𝐥 𝐧𝐮𝐦𝐛𝐞𝐫 𝐠𝐢𝐯𝐞𝐧 𝐢𝐧 𝐭𝐡𝐞 𝐢𝐧𝐩𝐮𝐭, 
𝐲𝐨𝐮 𝐬𝐡𝐨𝐮𝐥𝐝 𝐨𝐮𝐭𝐩𝐮𝐭 𝐭𝐡𝐞 𝐜𝐨𝐫𝐫𝐞𝐬𝐩𝐨𝐧𝐝𝐢𝐧𝐠 𝐜𝐨𝐧𝐭𝐢𝐧𝐮𝐞𝐝 𝐟𝐫𝐚𝐜𝐭𝐢𝐨𝐧.

°. ⑅ ♱♡°.+┈ 𝐒𝐚𝐦𝐩𝐥𝐞 𝐈/𝐎 ┈+.°♡♱ ⑅.°

┈︎┈︎┈︎┈︎┈︎┈︎┈︎𝐈𝐧𝐩𝐮𝐭┈︎┈︎┈︎┈︎┈︎┈︎┈︎
43 19
1 2

┈︎┈︎┈︎┈︎┈︎┈︎┈︎𝐎𝐮𝐭𝐩𝐮𝐭┈︎┈︎┈︎┈︎┈︎┈︎┈︎
[2;3,1,4]
[0;2]

˖◛⁺ https://www.udebug.com/UVa/834 ⑅♡

*/
