/*⁺₊⋆ ☾ ⋆ 𝟏𝟏𝟗𝟑𝟒 𝐌𝐚𝐠𝐢𝐜 𝐅𝐨𝐫𝐦𝐮𝐥𝐚 ⋆⁺₊⋆ ☁︎ */
/*

°. ⑅ ♱♡°.+┈ 𝐏𝐫𝐨𝐛𝐥𝐞𝐦 ┈+.°♡♱ ⑅.°
𝐘𝐨𝐮 𝐚𝐫𝐞 𝐠𝐢𝐯𝐞𝐧 𝐚 𝐪𝐮𝐚𝐝𝐫𝐚𝐭𝐢𝐜 𝐟𝐮𝐧𝐜𝐭𝐢𝐨𝐧,
𝐟(𝐱) = 𝐚𝐱𝟐 + 𝐛𝐱 + 𝐜𝐘𝐨𝐮 𝐚𝐫𝐞 𝐚𝐥𝐬𝐨 𝐠𝐢𝐯𝐞𝐧 𝐚 𝐝𝐢𝐯𝐢𝐬𝐨𝐫 𝐝 𝐚𝐧𝐝 𝐚 𝐥𝐢𝐦𝐢𝐭 𝐋.
𝐇𝐨𝐰𝐦𝐚𝐧𝐲 𝐨𝐟 𝐭𝐡𝐞 𝐟𝐮𝐧𝐜𝐭𝐢𝐨𝐧 𝐯𝐚𝐥𝐮𝐞𝐬 𝐟(𝟎), 𝐟(𝟏), . . . , 𝐟(𝐋) 
𝐚𝐫𝐞𝐝𝐢𝐯𝐢𝐬𝐢𝐛𝐥𝐞 𝐛𝐲 𝐝?

°. ⑅ ♱♡°.+┈ 𝐈/𝐎 ┈+.°♡♱ ⑅.°

⟡·⟡·⟡·𝐈𝐧𝐩𝐮𝐭·⟡·⟡·⟡
𝐈𝐧𝐩𝐮𝐭 𝐜𝐨𝐧𝐬𝐢𝐬𝐭𝐬 𝐨𝐟 𝐚 𝐧𝐮𝐦𝐛𝐞𝐫 𝐨𝐟 𝐭𝐞𝐬𝐭 𝐜𝐚𝐬𝐞𝐬.
𝐄𝐚𝐜𝐡 𝐭𝐞𝐬𝐭𝐜𝐚𝐬𝐞 𝐜𝐨𝐧𝐬𝐢𝐬𝐭𝐬 𝐨𝐟 𝐚 𝐬𝐢𝐧𝐠𝐥𝐞 𝐥𝐢𝐧𝐞 
𝐜𝐨𝐧𝐭𝐚𝐢𝐧𝐢𝐧𝐠 𝐭𝐡𝐞 𝐧𝐮𝐦𝐛𝐞𝐫𝐬𝐚 𝐛 𝐜 𝐝 𝐋 
(−𝟏𝟎𝟎𝟎 ≤ 𝐚, 𝐛, 𝐜 ≤ 𝟏𝟎𝟎𝟎, 𝟏 < 𝐝 < 𝟏𝟎𝟎𝟎𝟎𝟎𝟎,𝟎 ≤ 𝐋 < 𝟏𝟎𝟎𝟎).
𝐈𝐧𝐩𝐮𝐭 𝐢𝐬 𝐭𝐞𝐫𝐦𝐢𝐧𝐚𝐭𝐞𝐝 𝐛𝐲 𝐚 𝐥𝐢𝐧𝐞 𝐜𝐨𝐧𝐭𝐚𝐢𝐧𝐢𝐧𝐠 ‘𝟎 𝟎 𝟎 𝟎 𝟎’ 
𝐰𝐡𝐢𝐜𝐡 𝐬𝐡𝐨𝐮𝐥𝐝 𝐧𝐨𝐭 𝐛𝐞 𝐩𝐫𝐨𝐜𝐞𝐬𝐬𝐞𝐝.

⟡·⟡·⟡·𝐎𝐮𝐭𝐩𝐮𝐭·⟡·⟡·⟡
𝐏𝐫𝐢𝐧𝐭 𝐭𝐡𝐞 𝐚𝐧𝐬𝐰𝐞𝐫 𝐟𝐨𝐫 𝐞𝐚𝐜𝐡 𝐭𝐞𝐬𝐭 𝐜𝐚𝐬𝐞 
(𝐭𝐡𝐞 𝐧𝐮𝐦𝐛𝐞𝐫 𝐨𝐟 𝐟𝐮𝐧𝐜𝐭𝐢𝐨𝐧 𝐯𝐚𝐥𝐮𝐞𝐬 𝐟(𝟎), 𝐟(𝟏), . . . , 𝐟(𝐋) 
𝐝𝐢𝐯𝐢𝐬𝐢𝐛𝐥𝐞 𝐛𝐲 𝐝)𝐨𝐧 𝐚 𝐬𝐞𝐩𝐚𝐫𝐚𝐭𝐞 𝐥𝐢𝐧𝐞.

°. ⑅ ♱♡°.+┈ 𝐒𝐚𝐦𝐩𝐥𝐞 𝐈/𝐎 ┈+.°♡♱ ⑅.°

┈︎┈︎┈︎┈︎┈︎┈︎┈︎𝐈𝐧𝐩𝐮𝐭┈︎┈︎┈︎┈︎┈︎┈︎┈︎
0 0 10 5 100
0 0 10 6 100
1 2 3 4 5
1 2 3 3 5
0 0 0 0 0
┈︎┈︎┈︎┈︎┈︎┈︎┈︎𝐎𝐮𝐭𝐩𝐮𝐭┈︎┈︎┈︎┈︎┈︎┈︎┈︎
101
0
0
4

˖◛⁺ https://www.udebug.com/UVa/11934 ⑅♡

*/
